1. 
Бинарный поиск работает за время О(log_2(n)), 
где n - это количество элементов. 


2. 
Логарифмическое время - О(log_2(n)), 
простое время - О(n)


3. 
Задача о коммивояжёре относится к классу NP-трудных задач. 
Что это значит, я не знаю. 
И что такое NP я тоже не разобрался. 


4. 
Насколько я понял, ассимптотическая сложность - это значение, 
к которому стремится функция О() при n стремящемся к 
бесконечности. 


5. 
Время выполнения алгоритма не измеряется в секундах, потому 
что при разном количестве элементов в множестве отношение 
времени выполнения разных алгоритмов меняется нелинейно 
(так как в основном О() функции алгоритмов имеют 
нелинейный вид - за исключением простого поиска). 
Также, возможно, потому что на разных устройствах время 
выполнения каждого шага алгоритма может быть разным. 

6. 
Время выполнения алгоритма измеряется в тактах (итерациях). 


7. 
Время выполнения алгоритма выражается в виде Big O notation. 
По которому мы оцениваем функцию, описывающую затраты времени. 